Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.88/edc/PIC32CM2532LE00048.PIC
      <edc:AdjustPoint edc:_addr="0x41004009" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4100400A" edc:access="------nn" edc:cname="EVCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="AUTOWEI" edc:desc="Auto Write Event Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOWINV" edc:desc="Auto Write Event Polarity Inverted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100400B" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4100400C" edc:access="---nnnnn" edc:cname="INTENCLR" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="NVM Done Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Status Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Status Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:desc="Key Write Error Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100400D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41004010" edc:access="---nnnnn" edc:cname="INTENSET" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="NVM Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:desc="Key Write Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004011" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41004014" edc:access="---nnnnn" edc:cname="INTFLAG" edc:impl="0x1F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="NVM Done" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="KEYE" edc:desc="KEY Write Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004015" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x41004018" edc:access="-----------rrrrr" edc:cname="STATUS" edc:impl="0x1F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="Power Reduction Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="NVM Page Buffer Active Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="READY" edc:desc="NVM Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DALFUSE" edc:desc="Debug Access Level Fuse" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DAL0" edc:desc="Access to very limited features" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DAL2" edc:desc="Access to all memory. Can debug secure and non-secure CPU code" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100401A" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x4100401C" edc:access="--------nn------nnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:impl="0xC0FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="AOFFSET" edc:desc="NVM Address Offset In The Selected Array" edc:nzwidth="0x10"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ARRAY" edc:desc="Array Select" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FLASH" edc:desc="FLASH" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATAFLASH" edc:desc="DATA FLASH" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NVMROWS" edc:desc="NVM Configuration Rows" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004020" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004022" edc:access="nnnnnnnn-----nn-" edc:cname="NSULCK" edc:impl="0xFF06" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ANS" edc:desc="Non-Secure Application Region" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DNS" edc:desc="Non-Secure Data Region" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="NSLKEY" edc:desc="Write Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Write Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
